Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 64, 32, 1)]       0
_________________________________________________________________
conv2d (Conv2D)              (None, 62, 30, 100)       1000
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 31, 15, 100)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 14, 200)       80200
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 7, 200)        0
_________________________________________________________________
flatten (Flatten)            (None, 21000)             0
_________________________________________________________________
dropout (Dropout)            (None, 21000)             0
_________________________________________________________________
dense (Dense)                (None, 11)                231011
=================================================================
Total params: 312,211
Trainable params: 312,211
Non-trainable params: 0

