Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 64, 32, 1)]       0
_________________________________________________________________
conv2d (Conv2D)              (None, 62, 30, 32)        320
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 31, 15, 32)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 29, 13, 64)        18496
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 6, 64)         0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 13, 5, 128)        32896
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 2, 128)         0
_________________________________________________________________
flatten (Flatten)            (None, 1536)              0
_________________________________________________________________
dropout (Dropout)            (None, 1536)              0
_________________________________________________________________
dense (Dense)                (None, 11)                16907
=================================================================
Total params: 68,619
Trainable params: 68,619
Non-trainable params: 0

