Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 64, 32, 1)]       0
_________________________________________________________________
conv2d (Conv2D)              (None, 62, 30, 32)        320
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 31, 15, 32)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 14, 64)        8256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 7, 64)         0
_________________________________________________________________
flatten (Flatten)            (None, 6720)              0
_________________________________________________________________
dropout (Dropout)            (None, 6720)              0
_________________________________________________________________
dense (Dense)                (None, 11)                73931
=================================================================
Total params: 82,507
Trainable params: 82,507
Non-trainable params: 0

