Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 64, 32, 1)]       0
_________________________________________________________________
conv2d (Conv2D)              (None, 62, 30, 64)        640
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 31, 15, 64)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 14, 128)       32896
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 7, 128)        0
_________________________________________________________________
flatten (Flatten)            (None, 13440)             0
_________________________________________________________________
dropout (Dropout)            (None, 13440)             0
_________________________________________________________________
dense (Dense)                (None, 11)                147851
=================================================================
Total params: 181,387
Trainable params: 181,387
Non-trainable params: 0

